WebService/wsdl.xml

<?xml version="1.0" encoding="UTF-8"?>
	<!--
		Published by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is
		JAX-WS RI 2.2.4-b01.
	-->
	<!--
		Generated by JAX-WS RI at http://jax-ws.dev.java.net. RI's version is
		JAX-WS RI 2.2.4-b01.
	-->
<definitions
	xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
	xmlns:wsp="http://www.w3.org/ns/ws-policy" xmlns:wsp1_2="http://schemas.xmlsoap.org/ws/2004/09/policy"
	xmlns:wsam="http://www.w3.org/2007/05/addressing/metadata" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
	xmlns:tns="http://server.server.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns="http://schemas.xmlsoap.org/wsdl/" targetNamespace="http://server.server.com/"
	name="MyServerService">
	<types>
		<xsd:schema>
			<xsd:import namespace="http://server.server.com/"
				schemaLocation="http://192.168.8.120:8080/sayHello?xsd=1"></xsd:import>
		</xsd:schema>
	</types>
	<message name="sayHello">
		<part name="parameters" element="tns:sayHello"></part>
	</message>
	<message name="sayHelloResponse">
		<part name="parameters" element="tns:sayHelloResponse"></part>
	</message>
	<message name="kkk">
		<part name="parameters" element="tns:kkk"></part>
	</message>
	<message name="kkkResponse">
		<part name="parameters" element="tns:kkkResponse"></part>
	</message>
	<portType name="MyServer">
		<operation name="sayHello">
			<input wsam:Action="http://server.server.com/MyServer/sayHelloRequest"
				message="tns:sayHello"></input>
			<output wsam:Action="http://server.server.com/MyServer/sayHelloResponse"
				message="tns:sayHelloResponse"></output>
		</operation>
		<operation name="kkk">
			<input wsam:Action="http://server.server.com/MyServer/kkkRequest"
				message="tns:kkk"></input>
			<output wsam:Action="http://server.server.com/MyServer/kkkResponse"
				message="tns:kkkResponse"></output>
		</operation>
	</portType>
	<binding name="MyServerPortBinding" type="tns:MyServer">
		<soap:binding transport="http://schemas.xmlsoap.org/soap/http"
			style="document"></soap:binding>
		<operation name="sayHello">
			<soap:operation soapAction=""></soap:operation>
			<input>
				<soap:body use="literal"></soap:body>
			</input>
			<output>
				<soap:body use="literal"></soap:body>
			</output>
		</operation>
		<operation name="kkk">
			<soap:operation soapAction=""></soap:operation>
			<input>
				<soap:body use="literal"></soap:body>
			</input>
			<output>
				<soap:body use="literal"></soap:body>
			</output>
		</operation>
	</binding>
	<service name="MyServerService">
		<port name="MyServerPort" binding="tns:MyServerPortBinding">
			<soap:address location="http://192.168.8.120:8080/sayHello"></soap:address>
		</port>
	</service>
</definitions>